<a href="https://colab.research.google.com/github/hannasss/SOLUX_summer_data/blob/master/1%EC%A3%BC%EC%B0%A8/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

파일 불러오기

In [ ]:
df = pd.read_csv('friend_list.csv')

In [ ]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

head()는 5개까지 보여줌

In [ ]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [ ]:
df.head(2)

    name  age        job
0   John   20    student
1  Jenny   30  developer

뒤에서부터 5개 보여줌

In [ ]:
df.tail()

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [ ]:
df.tail(3)

    name  age      job
3  Julia   40  dentist
4  Brian   45  manager
5  Chris   25   intern

In [ ]:
df = pd.read_csv('friend_list.txt')

In [ ]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [ ]:
df = pd.read_csv('friend_list_tab.txt')

In [ ]:
df

         name\tage\tjob
0     John\t20\tstudent
1  Jenny\t30\tdeveloper
2     Nate\t30\tteacher
3    Julia\t40\tdentist
4    Brian\t45\tmanager
5     Chris\t25\tintern

구분단위가 ,가 아닌 탭이라는 것을 알려주기

In [ ]:
df = pd.read_csv('friend_list_tab.txt', delimiter = '\t')

In [ ]:
df

         name age job
0     John 20 student
1  Jenny 30 developer
2     Nate 30 teacher
3    Julia 40 dentist
4    Brian 45 manager
5     Chris 25 intern

In [ ]:
df = pd.read_csv('friend_list_no_head.csv')

In [ ]:
df

    John  20    student
0  Jenny  30  developer
1   Nate  30    teacher
2  Julia  40    dentist
3  Brian  45    manager
4  Chris  25     intern

헤더가 없음을 알려주기

In [ ]:
df = pd.read_csv('friend_list_no_head.csv',header = None)

In [ ]:
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

컬럼 네임 추가

In [ ]:
df.columns = ['name','age','job']

In [ ]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

한번에 하기

In [ ]:
df = pd.read_csv('friend_list_no_head.csv',header = None, names =['name','age','job'])

In [ ]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern